tiborsimon/embedded-tdd-headers/pic/pic16/pic16f630_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F630_H_
#define _PIC16F630_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define RA5                           18
#define PORTC                         19
#define RC0                           20
#define RC1                           21
#define RC2                           22
#define RC3                           23
#define RC4                           24
#define RC5                           25
#define PCLATH                        26
#define INTCON                        27
#define RAIF                          28
#define INTF                          29
#define T0IF                          30
#define TMR0IF                        31
#define RAIE                          32
#define INTE                          33
#define T0IE                          34
#define TMR0IE                        35
#define PEIE                          36
#define GIE                           37
#define PIR1                          38
#define T1IF                          39
#define TMR1IF                        40
#define CMIF                          41
#define EEIF                          42
#define T1CON                         43
#define TMR1ON                        44
#define TMR1CS                        45
#define nT1SYNC                       46
#define T1OSCEN                       47
#define T1CKPS0                       48
#define T1CKPS                        49
#define T1CKPS1                       50
#define TMR1GE                        51
#define CMCON                         52
#define CM                            53
#define CM0                           54
#define CM1                           55
#define CM2                           56
#define CIS                           57
#define CINV                          58
#define COUT                          59
#define OPTION_REG                    60
#define PS                            61
#define PS0                           62
#define PS1                           63
#define PS2                           64
#define PSA                           65
#define T0SE                          66
#define T0CS                          67
#define INTEDG                        68
#define nGPPU                         69
#define nRAPU                         70
#define TRISA                         71
#define TRISA0                        72
#define TRISA1                        73
#define TRISA2                        74
#define TRISA3                        75
#define TRISA4                        76
#define TRISA5                        77
#define TRISC                         78
#define TRISC0                        79
#define TRISC1                        80
#define TRISC2                        81
#define TRISC3                        82
#define TRISC4                        83
#define TRISC5                        84
#define PIE1                          85
#define T1IE                          86
#define TMR1IE                        87
#define CMIE                          88
#define EEIE                          89
#define PCON                          90
#define nBOR                          91
#define nBOD                          92
#define nPOR                          93
#define OSCCAL                        94
#define CAL0                          95
#define CAL                           96
#define CAL1                          97
#define CAL2                          98
#define CAL3                          99
#define CAL4                          100
#define CAL5                          101
#define WPUA                          102
#define WPUA0                         103
#define WPUA1                         104
#define WPUA2                         105
#define WPUA4                         106
#define WPUA5                         107
#define IOCA                          108
#define IOCA0                         109
#define IOCA1                         110
#define IOCA2                         111
#define IOCA3                         112
#define IOCA4                         113
#define IOCA5                         114
#define VRCON                         115
#define VR0                           116
#define VR                            117
#define VR1                           118
#define VR2                           119
#define VR3                           120
#define VRR                           121
#define VREN                          122
#define EEDAT                         123
#define EECON1                        124
#define RD                            125
#define WR                            126
#define WREN                          127
#define WRERR                         128

#endif // _PIC16F630_H_
